; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v6)
		(pred_4 ?v2)
		(pred_1 ?v1)
		(pred_5 ?v1)
		(pred_3 ?v2 ?v1)
		(pred_6)
		(pred_2 ?v2))

   (:action op_2
       :parameters  (?v5 ?v7)
       :precondition (and (not-eq ?v5 ?v7) 
                          (pred_1 ?v5) (pred_1 ?v7) (pred_5 ?v5))
       :effect (and  (pred_5 ?v7)
		     (not (pred_5 ?v5))))


   (:action op_3
       :parameters (?v8 ?v4)
       :precondition  (and  (pred_4 ?v8) (pred_1 ?v4)
			    (pred_3 ?v8 ?v4) (pred_5 ?v4) (pred_6))
       :effect (and (pred_2 ?v8)
		    (not (pred_3 ?v8 ?v4)) 
		    (not (pred_6))))

   (:action op_1
       :parameters  (?v8  ?v4)
       :precondition  (and  (pred_4 ?v8) (pred_1 ?v4)
			    (pred_2 ?v8) (pred_5 ?v4))
       :effect (and (pred_3 ?v8 ?v4)
		    (pred_6)
		    (not (pred_2 ?v8)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_02 obj_06 obj_05 obj_08 obj_07 
          obj_04 obj_01 obj_03 
)
(:init
(pred_1 obj_02)
(pred_1 obj_06)
(pred_1 obj_05)
(pred_1 obj_08)
(pred_1 obj_07)
(pred_4 obj_04)
(pred_4 obj_01)
(pred_4 obj_03)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_08)
(pred_6)
(pred_3 obj_04 obj_05)
(pred_3 obj_01 obj_08)
(pred_3 obj_03 obj_08)
(pred_5 obj_02)
)
(:goal
(and
(pred_3 obj_04 obj_05)
(pred_3 obj_01 obj_07)
(pred_3 obj_03 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_01 obj_07) (pred_5 obj_06))
    (sometime-before  (pred_3 obj_03 obj_06) (pred_5 obj_05))
  )
)
)

; plan
1. (op_2 obj_02 obj_08)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_08)
   goals met: 1 of 3
2. (op_3 obj_03 obj_08)
   deleted: (pred_3 obj_03 obj_08) (pred_6)
   added: (pred_2 obj_03)
   goals met: 1 of 3
3. (op_2 obj_08 obj_07)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_07)
   goals met: 1 of 3
4. (op_1 obj_03 obj_07)
   deleted: (pred_2 obj_03)
   added: (pred_3 obj_03 obj_07) (pred_6)
   goals met: 1 of 3
5. (op_2 obj_07 obj_08)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_08)
   goals met: 1 of 3
6. (op_3 obj_01 obj_08)
   deleted: (pred_3 obj_01 obj_08) (pred_6)
   added: (pred_2 obj_01)
   goals met: 1 of 3
7. (op_2 obj_08 obj_05)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_05)
   goals met: 1 of 3
8. (op_1 obj_01 obj_05)
   deleted: (pred_2 obj_01)
   added: (pred_3 obj_01 obj_05) (pred_6)
   goals met: 1 of 3
9. (op_2 obj_05 obj_07)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_07)
   goals met: 1 of 3
10. (op_3 obj_03 obj_07)
   deleted: (pred_3 obj_03 obj_07) (pred_6)
   added: (pred_2 obj_03)
   goals met: 1 of 3
11. (op_2 obj_07 obj_06)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_06)
   goals met: 1 of 3
12. (op_1 obj_03 obj_06)
   deleted: (pred_2 obj_03)
   added: (pred_3 obj_03 obj_06) (pred_6)
   goals met: 2 of 3
13. (op_2 obj_06 obj_05)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_05)
   goals met: 2 of 3
14. (op_3 obj_01 obj_05)
   deleted: (pred_3 obj_01 obj_05) (pred_6)
   added: (pred_2 obj_01)
   goals met: 2 of 3
15. (op_2 obj_05 obj_07)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_07)
   goals met: 2 of 3
16. (op_1 obj_01 obj_07)
   deleted: (pred_2 obj_01)
   added: (pred_3 obj_01 obj_07) (pred_6)
   goals met: 3 of 3
